erik-elemind/monorepo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO1_27 (coord T8), FLASH_MUX_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_FLASH_MUX_EN_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_FLASH_MUX_EN_SIGNAL PIO1               /*!<@brief Signal name */
#define BOARD_INITPINS_FLASH_MUX_EN_CHANNEL 27                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FLASH_MUX_EN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_FLASH_MUX_EN_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_FLASH_MUX_EN_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FLASH_MUX_EN_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FLASH_MUX_EN_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO1_30 (coord P10), HRM_RED_ANODE_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_SIGNAL PIO1               /*!<@brief Signal name */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_CHANNEL 30                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_HRM_RED_ANODE_EN_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO2_3 (coord T12), AUX_GPIO1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_AUX_GPIO1_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_AUX_GPIO1_SIGNAL PIO2              /*!<@brief Signal name */
#define BOARD_INITPINS_AUX_GPIO1_CHANNEL 3                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AUX_GPIO1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_AUX_GPIO1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_AUX_GPIO1_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AUX_GPIO1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AUX_GPIO1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_4 (coord T13), AUX_GPIO2
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_AUX_GPIO2_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_AUX_GPIO2_SIGNAL PIO2              /*!<@brief Signal name */
#define BOARD_INITPINS_AUX_GPIO2_CHANNEL 4                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AUX_GPIO2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_AUX_GPIO2_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_AUX_GPIO2_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AUX_GPIO2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AUX_GPIO2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_6 (coord U15), AUX_GPIO3
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_AUX_GPIO3_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_AUX_GPIO3_SIGNAL PIO2              /*!<@brief Signal name */
#define BOARD_INITPINS_AUX_GPIO3_CHANNEL 6                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AUX_GPIO3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_AUX_GPIO3_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_AUX_GPIO3_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AUX_GPIO3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AUX_GPIO3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_8 (coord U17), PS_HOLD
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PS_HOLD_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_PS_HOLD_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_PS_HOLD_CHANNEL 8                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PS_HOLD_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PS_HOLD_GPIO_PIN_MASK (1U << 8U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PS_HOLD_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PS_HOLD_PIN 8U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_PS_HOLD_PIN_MASK (1U << 8U)                /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_16 (coord D6), USER_BUTTON1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON1_PERIPHERAL PINT           /*!<@brief Peripheral name */
#define BOARD_INITPINS_USER_BUTTON1_SIGNAL PINT               /*!<@brief Signal name */
#define BOARD_INITPINS_USER_BUTTON1_CHANNEL 5                 /*!<@brief Signal channel */
#define BOARD_INITPINS_USER_BUTTON1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USER_BUTTON1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_20 (coord B2), USER_BUTTON2
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON2_PERIPHERAL PINT           /*!<@brief Peripheral name */
#define BOARD_INITPINS_USER_BUTTON2_SIGNAL PINT               /*!<@brief Signal name */
#define BOARD_INITPINS_USER_BUTTON2_CHANNEL 6                 /*!<@brief Signal channel */
#define BOARD_INITPINS_USER_BUTTON2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON2_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USER_BUTTON2_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_22 (coord D8), POWER_BTNn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_POWER_BTNn_PERIPHERAL PINT           /*!<@brief Peripheral name */
#define BOARD_INITPINS_POWER_BTNn_SIGNAL PINT               /*!<@brief Signal name */
#define BOARD_INITPINS_POWER_BTNn_CHANNEL 7                 /*!<@brief Signal channel */
#define BOARD_INITPINS_POWER_BTNn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_POWER_BTNn_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_POWER_BTNn_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO1_1 (coord G15), ISP_ENTRY
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_ISP_ENTRY_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_ISP_ENTRY_SIGNAL PIO1              /*!<@brief Signal name */
#define BOARD_INITPINS_ISP_ENTRY_CHANNEL 1                /*!<@brief Signal channel */

